app/Controllers/Grupos.php

    private function getGrupoOr404(int $id = null)
    {
        if (!$id || !$grupo = $this->grupoModel->withDeleted(true)->find($id)) {
---
SELECT *
FROM `grupos`
WHERE `grupos`.`id` = 7

    public function permissions(int $id = null)
    {
        $grupo = $this->getGrupoOr404($id);

        if ($grupo->id < 3) {
            return redirect()
                    ->back()
                    ->with('atencao', 'Não é necessário atribuir ou remover permissão para esse grupo.');
        }

        if ($grupo->id > 2) {
            $grupo->permissions = $this->grupoPermissionsModel->getPermissionsOfGrupo($grupo->id, 5);
            $grupo->pager = $this->grupoPermissionsModel->pager;
        }

        $data = [
            'title' => 'Gerenciando permissões do Grupo ' . esc($grupo->name),
            'grupo'  => $grupo,
        ];

        if (! empty($grupo->permissions)) {
            $permissionsExists = array_column($grupo->permissions, 'permission_id');
            $data['permissionsAvailables'] = $this->permissionModel->whereNotIn('id',$permissionsExists)->findAll();
        } else {
            $data['permissionsAvailables'] = $this->permissionModel->findAll();
---
SELECT *
FROM `permissions`
WHERE `id` NOT IN ('2','1')
SELECT *
FROM `permissions`