app/Controllers/Users.php

    private function getUserOr404(int $id = null)
    {
        # se o parametro id não foi passado ou não existe usuario na tabela
        if (!$id || !$user = $this->userModel->withDeleted(true)->find($id)) {
---
SELECT *
FROM `users`
WHERE `users`.`id` = 5001