app/Controllers/Users.php

  public function getUsers()
  {
    # se não for uma requisição AJAX, aborta execução
    if (!$this->request->isAJAX()) {
      return redirect()->back();
    }

    # array que representa os campos a recuperar
    $fields = [
      'id',
      'name',
      'email',
      'active',
      'image',
      'deleted_at',

    ];

    # objeto users recuperados da tabela
    $users = $this->userModel->select($fields)
      ->withDeleted(true)
      ->orderBy('id', 'DESC')
      ->findAll();
---
SELECT *
FROM `users`
WHERE `users`.`deleted_at` IS NULL
ORDER BY `id` DESC

  private function getUserOr404(int $id = null)
  {
    # se o parametro id não foi passado ou não existe usuario na tabela
    if (!$id || !$user = $this->userModel->withDeleted(true)->find($id)) {
---
SELECT *
FROM `users`
WHERE `users`.`id` = 5001

  private function getGrupoUserOr404(int $principal_id = null)
  {
    if (!$principal_id || !$grupoUser = $this->gruposUserModel->find($principal_id)) {
---
SELECT *
FROM `users`
WHERE `users`.`id` = 5001

  public function grupos(int $id = null)
  {
    $user = $this->getUserOr404($id);

    $user->grupos = $this->gruposUserModel->getGruposOfUser($user->id, 5);
    $user->pager = $this->gruposUserModel->pager;

    $data = [
      'title' => 'Gerenciando o Grupo de Permissão do Usuário ' . esc($user->name),
      'user'  => $user,
    ];

    # se vier no post um usuario como cliente (2), retorna uma msg erro...
    if (in_array(2, array_column($user->grupos, 'grupo_id'))) {
      return redirect()->to(site_url("users/view/$user->id"))->with('info', 'Este usuário é cliente, portanto não há necessidade de atribuir ou remover permissão de grupo.');
    }

    # se o usuario for administrador, exibe uma msg info tratada na view
    if (in_array(1, array_column($user->grupos, 'grupo_id'))) {
      $user->full_control = true;
      return view('Users/grupos', $data);
    }

    $user->full_control = false;

    # se o usuario tiver algum grupo
    if (!empty($user->grupos)) {
      # recuperar todos os grupos que este usuario não possui e também com exceção do grupo clientes
      $gruposExists = array_column($user->grupos, 'grupo_id');
      $data['gruposAvailables'] = $this->grupoModel->where('id != 2')
        ->whereNotIn('id', $gruposExists)
        ->findAll();
---
SELECT *
FROM `grupos`
WHERE `id` != 2
AND `id` NOT IN ('3','6','7')
AND `grupos`.`deleted_at` IS NULL

        'user_id' => $user->id
      ]);
    }
    $this->gruposUserModel->insertBatch($grupoPush);
---
INSERT INTO `grupos_users` (`grupo_id`, `user_id`) VALUES ('3','5001'), ('6','5001'), ('7','5001')