app/Models/GruposPermissionsModel.php

    public function getPermissionsOfGrupo(int $grupo_id, int $qtd_paginator)
    {
        $atributos = [
            'grupos_permissions.id',
            'grupos.id AS grupo_id',
            'permissions.id AS permission_id',
            'permissions.name'
        ];

        return $this->select($atributos)
                    ->join('grupos', 'grupos.id = grupos_permissions.grupo_id')
                    ->join('permissions', 'permissions.id = grupos_permissions.permission_id')
                    ->where('grupos_permissions.grupo_id', $grupo_id)
                    // ->groupBy('permissions.name')
                    ->paginate($qtd_paginator);
---
SELECT COUNT(*) AS `numrows`
FROM `grupos_permissions`
JOIN `grupos` ON `grupos`.`id` = `grupos_permissions`.`grupo_id`
JOIN `permissions` ON `permissions`.`id` = `grupos_permissions`.`permission_id`
WHERE `grupos_permissions`.`grupo_id` = 7
SELECT `grupos_permissions`.`id`, `grupos`.`id` AS `grupo_id`, `permissions`.`id` AS `permission_id`, `permissions`.`name`
FROM `grupos_permissions`
JOIN `grupos` ON `grupos`.`id` = `grupos_permissions`.`grupo_id`
JOIN `permissions` ON `permissions`.`id` = `grupos_permissions`.`permission_id`
WHERE `grupos_permissions`.`grupo_id` = 7
 LIMIT 5