app/Models/GruposUsersModel.php

SELECT `grupos_users`.`id` AS `principal_id`, `grupos`.`id` AS `grupo_id`, `grupos`.`name`, `grupos`.`description`
FROM `grupos_users`
JOIN `grupos` ON `grupos`.`id` = `grupos_users`.`grupo_id`
JOIN `users` ON `users`.`id` = `grupos_users`.`user_id`
WHERE `grupos_users`.`user_id` = 5001
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `grupos_users`
JOIN `grupos` ON `grupos`.`id` = `grupos_users`.`grupo_id`
JOIN `users` ON `users`.`id` = `grupos_users`.`user_id`
WHERE `grupos_users`.`user_id` = 5001
---
    public function getGruposOfUser(int $user_id, int $qtd_paginator)
    {
        $atributos = [
            'grupos_users.id AS principal_id',
            'grupos.id AS grupo_id',
            'grupos.name',
            'grupos.description',
        ];

        return $this->select($atributos)
                    ->join('grupos', 'grupos.id = grupos_users.grupo_id')
                    ->join('users', 'users.id = grupos_users.user_id')
                    ->where('grupos_users.user_id', $user_id)
                    //->groupBy('grupos.name')
                    ->paginate($qtd_paginator);